src/cf/InformationRegisters/уатКадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатКадроваяИсторияСотрудников</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНачислятьЗПВПЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКласс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПозывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатКадроваяИсторияСотрудников/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.Сотрудник) И Параметры.Свойство("Сотрудник") Тогда
		Запись.Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.Организация) И Параметры.Свойство("Организация") Тогда
		Запись.Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("Период") Тогда
		Запись.Период = Параметры.Период;
	КонецЕсли;
	
	Если Запись.ИсходныйКлючЗаписи.Период = '00010101'
		И НЕ ЗначениеЗаполнено(Запись.Организация)
		И ЗначениеЗаполнено(Запись.Сотрудник.Организация) Тогда
		Запись.Организация = Запись.Сотрудник.Организация;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		Элементы.Организация.ТолькоПросмотр = Ложь;
	КонецЕсли;
			
	УстановитьЗаголовокФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
		УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ПараметрыЗаписи.Свойство("БезПроверкиОрганизации") И ИзмененаОрганизацияСотрудника() Тогда
		Отказ = Истина;
		Оповещ = Новый ОписаниеОповещения("ПередЗаписьюВопрос", ЭтотОбъект);
		ТекстВопроса =
			"Будет изменена текущая организация сотрудника. Данные в отчетах по работе сотрудников за прошедший период станут некорректными. Продолжить?";
		ПоказатьВопрос(Оповещ, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюВопрос(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать(Новый Структура("БезПроверкиОрганизации", Истина));
		Если флЗакрытиеФормы Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	уатОбщегоНазначенияСервер.ОбновитьТекущееМестоРаботыВСправочникеСотрудники(ТекущийОбъект.Сотрудник, СообщениеОшибкаПриЗаписи);
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзменениеМестаРаботыСотрудника", Запись.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	флЗакрытиеФормы = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	флЗакрытиеФормы = Истина;
	флИзмененаОрганизация = ИзмененаОрганизацияСотрудника();
	Записать();
	Если НЕ флИзмененаОрганизация Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	Оповещ = Новый ОписаниеОповещения("УдалитьЗаписьВопрос", ЭтотОбъект);
	ПоказатьВопрос(Оповещ, "Удалить запись?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписьВопрос(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдалитьЗаписьСервер();
		Оповестить("ИзменениеМестаРаботыСотрудника", Запись.Сотрудник);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	Элементы.Организация.ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	Элементы.ГруппаПодсказка.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.Сотрудник) Тогда
		Запись.Организация = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Запись.Сотрудник, "Организация");
	КонецЕсли;
	
	УстановитьЗаголовокФормы()
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Запись.Сотрудник, Новый Структура, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Запись.Сотрудник, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Запись.Организация)
		И ЗначениеЗаполнено(Запись.Сотрудник) Тогда
		Запись.Организация = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Запись.Сотрудник, "Организация");
	КонецЕсли;
	
	УстановитьЗаголовокФормы();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьЗаписьСервер()
	ЗаписьМенеджер = РеквизитФормыВЗначение("Запись");
	ЗаписьМенеджер.Удалить();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	Если Запись.Сотрудник.Пустая() Тогда
		Заголовок = "Прием на работу";
	Иначе
		тблСрез = РегистрыСведений.уатКадроваяИсторияСотрудников.СрезПервых(, Новый Структура("Сотрудник", Запись.Сотрудник));
		Если тблСрез.Количество() = 0 Тогда
			Заголовок = "Прием на работу """ + Запись.Сотрудник + """";
		Иначе
			Если Запись.Период <= тблСрез[0].Период Тогда
				Заголовок = "Прием на работу """ + Запись.Сотрудник + """";
			Иначе
				Заголовок = "Кадровый перевод """ + Запись.Сотрудник + """";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзмененаОрганизацияСотрудника()
	тблСрез = РегистрыСведений.уатКадроваяИсторияСотрудников.СрезПоследних(, Новый Структура("Сотрудник", Запись.Сотрудник));
	Если тблСрез.Количество() = 0 Тогда
		флЭтаЗаписьПоследняя = Истина;
	Иначе
		тблСрез.Сортировать("Период Убыв");
		флЭтаЗаписьПоследняя = (Запись.Период >= тблСрез[0].Период);
	КонецЕсли;
	
	Возврат НЕ Запись.Сотрудник.Пустая()
		И НЕ Запись.Сотрудник.Организация.Пустая()
		И флЭтаЗаписьПоследняя
		И Запись.Сотрудник.Организация <> Запись.Организация;
КонецФункции	

#КонецОбласти
